data/scalar_verification/ad_1d_Pe10/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 0.001;

vertices
(
    (0      0      0)
    (10.0 0      0)
    (10.0 1.0 0)
    (0      1.0 0)
    (0      0      1.0)
    (10.0 0      1.0)
    (10.0 1.0 1.0)
    (0      1.0 1.0)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 1 1) simpleGrading (1 1 1)
);

edges ();

boundary
(
    inlet_drug
    {
        type patch;
        faces ((0 4 7 3));
    }
    outlet
    {
        type patch;
        faces ((2 6 5 1));
    }
    walls
    {
        type wall;
        faces (
            (1 5 4 0)
            (3 7 6 2)
        );
    }
    frontAndBack
    {
        type empty;
        faces (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs ();
